  // date type -тип данных - маалымат турлору

  // number - 123456789
  // string - "jhfrug" "jfirn"
  // boolean - true / false
  // bigint -  чон сандар
  // symbol - +, -, =, %, / * **
  // null - жок нерсе
  // undefined - белгисиз
  // object - {}


  // переменый

 // var xx
// const
// let

// let num = 20
//   num = 30
//   console.log(num + num)


// const num = 193
// num = 293
// console.log(num)


// +
//   -
//   *
//   **
//   /
//   %

  // let nam = 40
  // num = 97
  // console.log(nam * num)


//******************************************************************************************


  // 1. Вам дана переменная num, присвойте ей значение. Выведите значение
  // этой переменной в консоль.


  // 2. Вам даны переменные a=10, b=2 и c=5. Выведите в консоль их сумму.
  // let a = 10
  // b = 2
  // c = 5
  // console.log(a + b + c)


  // 3. Вам дана переменная со значением 100, выведите в консоль умноженную переменную на 2.
  // let arr = 100
  // console.log(arr * 2)


  // 4. Вам дана переменная со значением 67. Выведите в консоль остаток деления на 7.
  // let a = 67
  // console.log(a % 7)


  // 5. Вам даны переменные a=10 и b=2. Выведите в консоль их сумму, разность,
  // произведение и частное (результат деления).
  // let a = 10
  // let c = 2
  // console.log(a + c)
  // console.log(a - c)
  // console.log(a * c)
  // console.log(a / c)


  // 6. Вам даны переменные c=15 и d=2. Просуммируйте их, а результат присвойте
  // переменной result. Выведите в консоль значение переменной result.
  // let c = 15
  // let d = 2
  // let result = c + d
  // console.log(result)


  // 7. Вам даны переменные a=30, и b=15 Сложите переменные a и b и результат
  // присвойте переменной c. Затем выведите в консоль остаток деления на 4 переменной c.

  // 8. Вам даны переменные a=17 и b=10. Отнимите от a переменную b и результат
  // присвойте переменной c. Затем создайте переменную d, присвойте ей значение.
  // Сложите переменные c и d, а результат запишите в переменную result. Выведите
  // в консоль значение переменной result.


  // 9. Вам даны a='10' и b='99'. Сложите переменные a и b и присвойте результат
  // переменной result и выведите её в консоль.


  // 10. Вам даны переменные name='Аскар', number=10. Сложите данные переменные,
  // присвойте результат переменной result и выведите её в консоль.
